# Нужно отсортировать целые числа в списке. При этом, местоположение нулей менять нельзя.
# [5, 3, 0, 0, 4, 1, 4, 0, 7] => [1, 3, 0, 0, 4, 4, 5, 0, 7]
lst = [5, 3, 0, 0, 4, 1, 4, 0, 7]
# [0, 2, 3, 1, 0, 4, 5] => [0, 1, 2, 3, 0, 4, 5]
# lst = [0, 2, 3, 1, 0, 4, 5]
# [0, 0, 0, 1, 0] => [0, 0, 0, 1, 0]
# lst = [0, 0, 0, 1, 0]
# [4, 5, 3, 1, 1] => [1, 1, 3, 4, 5]
# lst = [4, 5, 3, 1, 1]
# [0, 0, 3, 0, 0, 1, 7] => [0, 0, 1, 0, 0, 3, 7]
# lst = [0, 0, 3, 0, 0, 1, 7]
lst0 = []
x = 1
y = 0
if lst.count(0) != 0:
    while x < lst.count(0) + 1:
        lst0.append(lst.index(0, y))
        y = lst.index(0, y) + 1
        x = x + 1
    x = lst.count(0)
    lst.sort()
    del(lst[0:x])
    for i in lst0:
        lst.insert(i, 0)
else:
    lst.sort()
print(lst)
